surfaceWater/runCases/RANS/ChoosingTurbulenceModel/3mmx0.1mm_kw/constant/g
//     t      acc    omega   dOmegadt
(
    ( 0.0      ((-1.3514e-3 0 0) (0 0 0) (0 0 0)))
    ( 100000.0  ((-1.3514e-3 0 0) (0 0 0) (0 0 0)))
);
