surfaceWater/runCases/RANS/ChoosingTurbulenceModel/3mmx0.1mm_kw/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1056
(
0.00118283
0.00118316
0.00118347
0.00118369
0.0011813
0.00118106
0.00116569
0.00116491
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            zeroGradient;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
0.00122207
0.00122207
0.00122207
0.00122207
0.0012171
0.0012171
0.00120195
0.00120195
...
)
;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
0.00122207
0.00122207
0.00122207
0.00122207
0.0012171
0.0012171
0.00120195
0.00120195
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
